Revit 2027 API
FabricationConfiguration.AreItemFilesLoaded Method
 Checks if the fabrication item files have been loaded.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AreItemFilesLoaded(
	IList<FabricationItemFile> itemFiles
)
Public Function AreItemFilesLoaded (
	itemFiles As IList(Of FabricationItemFile)
) As Boolean
public:
bool AreItemFilesLoaded(
	IList<FabricationItemFile^>^ itemFiles
)
member AreItemFilesLoaded :
        itemFiles : IList<FabricationItemFile> -> bool
Parameters
itemFiles IList<FabricationItemFile>
 The fabrication item files.
Return Value
Boolean
 Returns true if the fabrication item files have been loaded, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace